app/views/lists/sorting.html.erb

SELECT COUNT(*) FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 1]]
---

<% if (current_user.lists.nil?)||(current_user.lists.count == 0) %>