app/controllers/landing_controller.rb

  def change_locale
    begin
      locale = params[:locale]
      raise 'unsupported locale' unless ['ru', 'en'].include?(locale)
      User.find(current_user.id).update_attribute(:locale, locale) if current_user && !current_user.blank?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "locale" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["locale", "ru"], ["updated_at", "2020-10-16 23:46:37.581318"], ["id", 1]]

  def set_user_locale
    begin
      print "set_current_user.locale"
      user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]