app/controllers/lists_controller.rb

  def create
    new_list
    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("title_list", "priority_list", "deadline_list", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @list.update(list_params)
---
UPDATE "lists" SET "deadline_list" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["deadline_list", "2020-07-17 00:51:00"], ["updated_at", "2020-10-17 17:36:08.228698"], ["id", 5]]

  def complete
    @task.update_attribute(:status, 'completed')
---
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", "completed"], ["updated_at", "2020-10-17 00:26:22.225036"], ["id", 2]]

  def set_list
    @list = List.find(list_id)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_user_locale
    user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def owner
    @list = current_user.lists.find_by(id: params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def task_owner
    @tid = task_id
    current_user.lists.each do |list|
      list.tasks.each do |task|
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 2]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 2]]

  def setup_current_user_locale
    User.find(current_user.id).update_attribute(:locale, I18n.locale) if current_user.locale.blank?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "locale" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["locale", "en"], ["updated_at", "2020-10-16 23:46:11.935000"], ["id", 1]]