app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("content_task", "priority_task", "deadline_task", "list_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @list.tasks.new(task_params).save

UPDATE "tasks" SET "content_task" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["content_task", "Task 1"], ["updated_at", "2020-10-16 23:47:15.210366"], ["id", 1]]
UPDATE "tasks" SET "content_task" = $1, "priority_task" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["content_task", "Task 22"], ["priority_task", 2], ["updated_at", "2020-10-17 01:08:11.394415"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @task.update(update_params)
        format.html { redirect_to root_path, notice: t('task.updated') }

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
---
  def destroy
    @task.destroy
    respond_to do |format|
      format.html { redirect_to root_path, notice: t('task.destroyed') }

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_list
    @user = User.find(current_user.id)
    @list = @user.lists.find(task_params[:list_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_user_locale
    user = User.find(current_user.id)

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 1]]
---
  def owner
    @tid = task_id
    current_user.lists.each do |list|
      list.tasks.each do |task|